In [1]:
import os
os.chdir("C:/Users/Jackd/Desktop/Group Assignment")
os.getcwd()

'C:\\Users\\Jackd\\Desktop\\Group Assignment'

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from statsmodels.tsa.stattools import grangercausalitytests

In [13]:
FFR = pd.read_csv("DFF.csv")
infl = pd.read_csv("GDPCTPI.csv")
infl.drop('GDPCTPI_PC1', inplace=True, axis=1)
UE = pd.read_csv("UNRATE.csv")

In [18]:
FFR.rename(columns={'DATE':'Date', 'DFF':'R'}, inplace=True)
FFR['Date'] = pd.to_datetime(FFR['Date'],format='%Y/%m/%d').dt.to_period('M')
FFR = FFR.set_index('Date')

In [15]:
infl.rename(columns={'DATE':'Date', 'Inflation':'π'}, inplace=True)
infl['Date'] = pd.to_datetime(infl['Date'],format='%d/%m/%Y').dt.to_period('M')
infl = infl.set_index('Date')

In [22]:
UE.rename(columns={'DATE':'Date', 'UNRATE':'u'}, inplace=True)
UE['Date'] = pd.to_datetime(UE['Date'],format='%Y/%m/%d').dt.to_period('M')
UE = UE.set_index('Date')

In [19]:
FFR

                R
Date
1960-01  3.931319
1960-04  3.695055
1960-07  2.937500
1960-10  2.296196
1961-01  1.987556
...           ...
1999-10  5.304022
2000-01  5.677692
2000-04  6.271978
2000-07  6.519457
2000-10  6.474891

[164 rows x 1 columns]

In [16]:
infl

                  π
Date
1960-01  102.851000
1960-04  123.825368
1960-07  127.489114
1960-10  141.553621
1961-01  121.626841
...             ...
1999-10  198.436644
2000-01  286.035869
2000-04  314.554815
2000-07  357.172812
2000-10  359.761987

[164 rows x 1 columns]

In [23]:
UE

                u
Date
1960-01  5.133333
1960-04  5.233333
1960-07  5.533333
1960-10  6.266667
1961-01  6.800000
...           ...
1999-10  4.066667
2000-01  4.033333
2000-04  3.933333
2000-07  4.000000
2000-10  3.900000

[164 rows x 1 columns]